{"keras_version": "2.2.2", "config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activation": "relu", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 50, "name": "dense_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1001], "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 50, "name": "dense_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 1, "name": "dense_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}